### EDA and Feature Engineering on Black Friday Dataset.

In [1]:
# import required libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [6]:
# Set the working directory
import io
%cd "Datasets/"

[WinError 2] The system cannot find the file specified: 'Datasets/'
e:\iNeuron\EDA_and_Feature_Engineering\Day_2_Black_Friday_Dataset\Datasets

In [7]:
# Read the datasets
train = pd.read_csv("train.csv")
test = pd.read_csv("test.csv")

In [8]:
# check the dimensions of train and the test data
print("Train Dataset:", train.shape)
print("Test Dataset:", test.shape)

Train Dataset: (550068, 12)
Test Dataset: (233599, 11)

In [9]:
# First five records from train data
train.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [10]:
# First five records from test data
test.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [11]:
# check the datatypes in train data
train.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

In [12]:
# check the datatypes present in test data
test.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
dtype: object

In [14]:
# Descriptive statistics of train data
train.describe(include='all').transpose()

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
User_ID,550068.0,NaN,NaN,NaN,1003028.842401,1727.591586,1000001.0,1001516.0,1003077.0,1004478.0,1006040.0
Product_ID,550068,3631,P00265242,1880,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Gender,550068,2,M,414259,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Age,550068,7,26-35,219587,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Occupation,550068.0,NaN,NaN,NaN,8.076707,6.52266,0.0,2.0,7.0,14.0,20.0
City_Category,550068,3,B,231173,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Stay_In_Current_City_Years,550068,5,1,193821,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Marital_Status,550068.0,NaN,NaN,NaN,0.409653,0.49177,0.0,0.0,0.0,1.0,1.0
Product_Category_1,550068.0,NaN,NaN,NaN,5.40427,3.936211,1.0,1.0,5.0,8.0,20.0
Product_Category_2,376430.0,NaN,NaN,NaN,9.842329,5.08659,2.0,5.0,9.0,15.0,18.0
Product_Category_3,166821.0,NaN,NaN,NaN,12.668243,4.125338,3.0,9.0,14.0,16.0,18.0
Purchase,550068.0,NaN,NaN,NaN,9263.968713,5023.065394,12.0,5823.0,8047.0,12054.0,23961.0

In [16]:
# Descriptive statistics of test data
test.describe(include='all').transpose()

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
User_ID,233599.0,NaN,NaN,NaN,1003029.356859,1726.504968,1000001.0,1001527.0,1003070.0,1004477.0,1006040.0
Product_ID,233599,3491,P00265242,829,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Gender,233599,2,M,175772,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Age,233599,7,26-35,93428,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Occupation,233599.0,NaN,NaN,NaN,8.085407,6.521146,0.0,2.0,7.0,14.0,20.0
City_Category,233599,3,B,98566,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Stay_In_Current_City_Years,233599,5,1,82604,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Marital_Status,233599.0,NaN,NaN,NaN,0.41007,0.491847,0.0,0.0,0.0,1.0,1.0
Product_Category_1,233599.0,NaN,NaN,NaN,5.276542,3.73638,1.0,1.0,5.0,8.0,18.0
Product_Category_2,161255.0,NaN,NaN,NaN,9.849586,5.094943,2.0,5.0,9.0,15.0,18.0
Product_Category_3,71037.0,NaN,NaN,NaN,12.669454,4.125944,3.0,9.0,14.0,16.0,18.0

In [17]:
# Concise summary of train data
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     550068 non-null  int64
 1   Product_ID                  550068 non-null  object
 2   Gender                      550068 non-null  object
 3   Age                         550068 non-null  object
 4   Occupation                  550068 non-null  int64
 5   City_Category               550068 non-null  object
 6   Stay_In_Current_City_Years  550068 non-null  object
 7   Marital_Status              550068 non-null  int64
 8   Product_Category_1          550068 non-null  int64
 9   Product_Category_2          376430 non-null  float64
 10  Product_Category_3          166821 non-null  float64
 11  Purchase                    550068 non-null  int64
dtypes: float64(2), int64(5), object(5)
memory usage: 50.4+ MB

In [18]:
# Concise summary of test data
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 233599 entries, 0 to 233598
Data columns (total 11 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     233599 non-null  int64
 1   Product_ID                  233599 non-null  object
 2   Gender                      233599 non-null  object
 3   Age                         233599 non-null  object
 4   Occupation                  233599 non-null  int64
 5   City_Category               233599 non-null  object
 6   Stay_In_Current_City_Years  233599 non-null  object
 7   Marital_Status              233599 non-null  int64
 8   Product_Category_1          233599 non-null  int64
 9   Product_Category_2          161255 non-null  float64
 10  Product_Category_3          71037 non-null   float64
dtypes: float64(2), int64(4), object(5)
memory usage: 19.6+ MB

In [19]:
# check for null/missing values in train data
train.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            173638
Product_Category_3            383247
Purchase                           0
dtype: int64

In [31]:
def missing_values(data):
    for i in data.columns:
        missing = (data[i].isnull().sum()/data.shape[0])*100
        print(i, "=>", missing)

In [32]:
# check for % missing values in train data
missing_values(train)

User_ID => 0.0
Product_ID => 0.0
Gender => 0.0
Age => 0.0
Occupation => 0.0
City_Category => 0.0
Stay_In_Current_City_Years => 0.0
Marital_Status => 0.0
Product_Category_1 => 0.0
Product_Category_2 => 31.56664266963357
Product_Category_3 => 69.67265865311198
Purchase => 0.0

In [34]:
# check for duplicate records in train data
train.duplicated().sum()

0

In [25]:
# check for null/missing values in test data
test.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2             72344
Product_Category_3            162562
dtype: int64

In [33]:
# check for % missing values in test data
missing_values(test)

User_ID => 0.0
Product_ID => 0.0
Gender => 0.0
Age => 0.0
Occupation => 0.0
City_Category => 0.0
Stay_In_Current_City_Years => 0.0
Marital_Status => 0.0
Product_Category_1 => 0.0
Product_Category_2 => 30.96931065629562
Product_Category_3 => 69.59019516350669

In [35]:
# check for duplicate records in test data
test.duplicated().sum()

0

In [36]:
# We don't need User ID and Product_Category_3 has almost 70% missing values so we wil drop this columns
train_new = train.drop(['User_ID', 'Product_Category_3'], axis=1) 
test_new = test.drop(['User_ID', 'Product_Category_3'], axis=1)

In [39]:
print("Training Dataset:",train_new.shape)
print("Test Dataset:",test_new.shape)

Training Dataset: (550068, 10)
Test Dataset: (233599, 9)

In [40]:
missing_values(train_new)

Product_ID => 0.0
Gender => 0.0
Age => 0.0
Occupation => 0.0
City_Category => 0.0
Stay_In_Current_City_Years => 0.0
Marital_Status => 0.0
Product_Category_1 => 0.0
Product_Category_2 => 31.56664266963357
Purchase => 0.0

In [41]:
train_new['Product_Category_2'].value_counts()

8.0     64088
14.0    55108
2.0     49217
16.0    43255
15.0    37855
5.0     26235
4.0     25677
6.0     16466
11.0    14134
17.0    13320
13.0    10531
9.0      5693
12.0     5528
10.0     3043
3.0      2884
18.0     2770
7.0       626
Name: Product_Category_2, dtype: int64

#### Instead of removing the missing values we will exclude them during EDA and when we train model we will impute them with "missing_data" in later stages of this project